Repository: sruusk/weather
Catalog: lib/l10n/app_*.arb
Languages: fi

source: Sign Up
fi: Rekisteröidy

source: Name
fi: Nimi

source: Enter your name
fi: Syötä nimesi

source: Email
fi: Sähköposti

source: Enter your email
fi: Syötä sähköpostiosoitteesi

source: Password
fi: Salasana

source: Enter your password
fi: Syötä salasanasi

# createAccount
source: Create an account
fi: Luo tili

# haveAccountLogin
source: Have an account? Login
fi: Onko sinulla tili? Kirjaudu

source: Or
fi: Tai

source: Sign in with Google
fi: Kirjaudu Google-tilillä

# unknownError
source: An unknown error occurred
fi: Tuntematon virhe tapahtui

# appTitle
source: Weather
fi: Sää

source: No location selected
fi: Sijaintia ei ole valittu

# error
source: Error: {error}
fi: Virhe: {error}

source: No observation stations found
fi: Havaintoasemia ei löytynyt

# distance
source: Distance: {distance} km
fi: Etäisyys: {distance} km

source: Temperature
fi: Lämpötila

source: Humidity
fi: Kosteus

source: Dew Point
fi: Kastepiste

source: Wind Speed
fi: Tuulen nopeus

source: Wind Direction
fi: Tuulen suunta

source: Wind Gust
fi: Tuulen puuska

source: Precipitation
fi: Sademäärä

source: Snow Depth
fi: Lumen syvyys

source: Pressure
fi: Ilmanpaine

source: Cloud Base
fi: Pilvien korkeus

source: Visibility
fi: Näkyvyys

# noTemperatureHistoryData
source: No temperature history data available
fi: Lämpötilahistoriaa ei saatavilla

# temperatureCelsius
source: Â°C
fi: °C

# homePageTitle
source: Weather
fi: Sää

# favouritesPageTitle
source: Favourites
fi: Suosikit

# warningsPageTitle
source: Warnings
fi: Varoitukset

# weatherSymbolsPageTitle
source: Weather Symbols
fi: Sääsymbolit

# settingsPageTitle
source: Settings
fi: Asetukset

# aboutPageTitle
source: About
fi: Tietoja

source: Get Current Weather
fi: Hae nykyinen sää

source: Check for Warnings
fi: Tarkista hälytykset

source: Contact Support
fi: Ota yhteyttä tukeen

source: Language
fi: Kieli

source: Temperature Unit
fi: Lämpötilayksikkö

source: Notifications
fi: Ilmoitukset

source: Version
fi: Versio

# appDescription
source: A simple weather application that provides current weather conditions, forecasts, and weather warnings.
fi: Yksinkertainen sääsovellus, joka tarjoaa nykyiset sääolosuhteet, ennusteet ja säävaroitukset.

# languageSupport
source: This app supports both English and Finnish languages.
fi: Tämä sovellus tukee sekä englannin että suomen kieltä.

source: Clear Day
fi: Selkeä Päivä

source: Clear Night
fi: Selkeä Yö

source: Partly Cloudy Day
fi: Osittain Pilvinen Päivä

source: Partly Cloudy Night
fi: Osittain Pilvinen Yö

source: Cloudy
fi: Pilvinen

source: Rain
fi: Sade

source: Thunderstorm
fi: Ukkosmyrsky

source: Thunderstorm with Rain
fi: Ukkosmyrsky Sateella

source: Snow
fi: Lumi

source: Fog
fi: Sumu

source: Wind
fi: Tuuli

source: Thunderstorm (Line)
fi: Ukkosmyrsky (Viiva)

source: Wind (Line)
fi: Tuuli (Viiva)

# clearDayDesc
source: Clear sky during daytime
fi: Kirkas taivas päivällä

# clearNightDesc
source: Clear sky during nighttime
fi: Kirkas taivas yöllä

# partlyCloudyDayDesc
source: Some clouds during daytime
fi: Joitakin pilviä päivällä

# partlyCloudyNightDesc
source: Some clouds during nighttime
fi: Joitakin pilviä yöllä

# cloudyDesc
source: Mostly or completely cloudy
fi: Enimmäkseen tai täysin pilvinen

# rainDesc
source: Rainfall
fi: Sademäärä

# thunderstormDesc
source: Storm with thunder and lightning
fi: Myrsky ukkosella ja salamoinnilla

# thunderstormWithRainDesc
source: Storm with thunder, lightning and rain
fi: Myrsky ukkosella, salamoinnilla ja sateella

# snowDesc
source: Snowfall
fi: Lumisade

# fogDesc
source: Reduced visibility due to fog
fi: Heikentynyt näkyvyys sumun vuoksi

# windDesc
source: Strong winds
fi: Voimakkaat tuulet

# tornadoDesc
source: Violent rotating column of air
fi: Voimakas pyörivä ilmapatsas

# lineStyleDesc
source: Line style version
fi: Viivatyylinen versio

# radar
source: Weather Radar
fi: Sadetutka

source: App settings and preferences
fi: Sovelluksen asetukset ja määritykset

source: Enabled
fi: Käytössä

source: Geolocation
fi: Sijainti

source: Disabled
fi: Pois käytöstä

# settingsSync
source: Preferences Sync
fi: Synkronointi

# settingsSyncDesc
source: Synchronize your app preferences and favourites across devices
fi: Synkronoi sovelluksen asetukset ja suosikit laitteiden välillä.

source: Login
fi: Kirjaudu sisään

source: Logout
fi: Kirjaudu ulos

# logoutConfirmationTitle
source: Logout?
fi: Kirjaudu ulos?

# logoutConfirmationMessage
source: Are you sure you want to logout? Your preferences and favourites will not be lost.
fi: Haluatko varmasti kirjautua ulos?

source: Cancel
fi: Peruuta

source: Theme
fi: Teema

source: Dark
fi: Tumma

source: Light
fi: Vaalea

source: System
fi: Järjestelmä

source: Search for location
fi: Etsi sijaintia

# searchAndAddFavourites
source: Search and add to favourites
fi: Etsi ja lisää suosikkeihin

# supportContactNotImplemented
source: Support contact feature not implemented yet.
fi: Yhteydenotto ei ole vielä mahdollista.

source: No saved locations
fi: Ei tallennettuja sijainteja

# dataSourcesHeader
source: Data Sources
fi: Tietolähteet

# openMeteoDescription
source: Weather data by Open-Meteo.com
fi: Säädata - Open-Meteo

# fmiDescription
source: Observations, alerts, radar images and HARMONIE forecast by the Finnish Meteorological Institute.
fi: Havainnot, varoitukset, tutkakuvat ja HARMONIE sääennuste - Ilmatieteen laitos.

# openStreetMapDescription
source: Map data by OpenStreetMap
fi: Karttadata - OpenStreetMap

source: Visit Website
fi: Vieraile sivustolla

# licensesHeader
source: Licenses
fi: Lisenssit

# smartmetAlertClientLicense
source: MIT License
fi: MIT Lisenssi

source: View License
fi: Näytä lisenssi

source: Observations
fi: Havainnot

# weatherWarnings
source: Warnings
fi: Varoitukset

# noWeatherWarningsForDay
source: No weather warnings for today
fi: Ei säävaroituksia tälle päivälle

# otherPageTitle
source: Other
fi: Muut

# settingsPageDescription
source: Configure app settings and preferences
fi: Määritä sovelluksen asetukset ja määritykset

# weatherSymbolsPageDescription
source: View and learn about weather symbols used in the app
fi: Katso ja opi sovelluksessa käytetyistä sääsymboleista

# aboutPageDescription
source: Information about data sources and licenses
fi: Tietoa tietolähteistä ja lisensseistä

# favouritesPageDescription
source: View and manage your saved locations
fi: Tarkastele ja muokkaa tallennettuja sijainteja

# locating
source: Locating your position...
fi: Paikannetaan...

source: Loading forecasts...
fi: Ladataan ennusteita...

# geolocationTimeout
source: Geolocation request timed out. Please check your device settings.
fi: Sijainnin haku epäonnistui.

source: Retry
fi: Yritä uudelleen

# syncFavourites
source: Favourites
fi: Suosikit

# syncFavouritesDesc
source: Synchronize your favourites
fi: Synkronoi suosikit laitteiden välillä.

# syncToAppwrite
source: Sync
fi: Synkronoi

# syncFavouritesSuccess
source: Favourites synchronized successfully.
fi: Suosikkien synkronointi onnistui.

# syncFavouritesError
source: Error synchronizing favourites: {error}
fi: Synkronointi epäonnistui: {error}

# addLocationsInFavourites
source: You can add locations on the Favourites page.
fi: Voit lisätä sijainteja siirtymällä suosikkeihin

source: Go to Favourites
fi: Siirry suosikkeihin

source: Delete Account
fi: Poista tili

# deleteAccountConfirmationTitle
source: Delete Account?
fi: Vahvista tilin poisto

# deleteAccountConfirmationMessage
source: Are you sure you want to delete your account? This action cannot be undone and will remove all your data.
fi: Haluatko varmasti poistaa tilisi? Tämä poistaa kaikki tietosi pysyvästi.

# deleteAccountSuccess
source: Account deleted successfully.
fi: Tili poistettiin onnistuneesti.

# deleteAccountError
source: Error deleting account.
fi: Tilin poisto epäonnistui.

# locationServicesDisabled
source: Location services are disabled. Please enable location services in your device settings.
fi: Sijaintipalvelut ovat pois käytöstä. Ota sijaintipalvelut käyttöön laitteen asetuksista.

# locationPermissionDenied
source: Location permission denied. Please allow the app to access your location.
fi: Sijaintilupa evätty. Salli sovelluksen käyttää sijaintiasi.

# locationPermissionPermanentlyDenied
source: Location permission permanently denied. Please enable location access in app settings.
fi: Sijaintilupa pysyvästi evätty. Ota sijainti käyttöön sovelluksen asetuksista.

source: Play
fi: Toista

source: Pause
fi: Pysäytä

# minutesAgo
source: {minutes} min ago
fi: {minutes} min. sitten

source: Reset Map Position
fi: Nollaa kartan sijainti

source: Open Settings
fi: Avaa asetukset

# ossLicenses
source: Open Source Licenses
fi: Avoimen Lähdekoodin Lisenssit

# amoledTheme
source: AMOLED Dark
fi: AMOLED Tumma
